In [1]:
#pip install sqlalchemy
#pip install lxml
#pip install html5lib
#pip install BeautifulSoup4

import pandas as pd

In [2]:
pwd

'c:\\DP\\Python\\Python for Data Analysis - Pandas'

In [4]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df=pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df.to_csv('My_output')

In [8]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [12]:
df.to_csv('My_output', index=False)

In [13]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
# pandas can also import or export images, formula macros
# for excel files pip install xlrd
# this worked for the older version in the recent one use the following

In [23]:
import openpyxl
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')
#pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1', index_col=0, engine = "openpyxl")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [25]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [30]:
#importing HTML files
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [35]:
data
type(data)

list

In [34]:
data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
1,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
2,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
3,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
4,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [42]:
#reading sql files
#pandas is not the best tool to understad SQL
#as SQL has many flavors like Mysql, Postsql

from sqlalchemy import create_engine
engine=create_engine('sqlite:///:memory:') #sql database created

In [43]:
df.to_sql('Excel_Sample2.xlsx', engine)

4

In [47]:
sqldf=pd.read_sql('Excel_Sample2.xlsx', con=engine)

In [45]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [49]:
sqldf=sqldf.drop('index', axis=1)

In [50]:
sqldf

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15